from typing import Any, Text, Dict, List

from rasa_sdk.events import SlotSet
from rasa_sdk import Action, Tracker
from rasa_sdk.executor import CollectingDispatcher

class Action_Calculate_Code(Action):

    def name(self) -> Text:
        return "action_calc_code"

    def run(self, dispatcher: CollectingDispatcher,
            tracker: Tracker,
            domain: Dict[Text, Any]) -> List[Dict[Text, Any]]:

        def most_frequent(List):
            dict = {}
            count, itm = 0, ''
            for item in reversed(List):
                dict[item] = dict.get(item, 0) + 1
                if dict[item] >= count:
                    count, itm = dict[item], item
            return(itm)

        def getcode(questions):
            c1 = most_frequent(questions[0:3])
            c2 = most_frequent(questions[3:6])
            c3 = most_frequent(questions[6:9])
            c4 = most_frequent(questions[9:12])
            return c1+c2+c3+c4

        codes = {
            "ENTP": {'disc': " المخترع وهي شخصية مبتكرة، منطقية، وفضولية. يرى المخترع فرص تطوير الأشياء باستمرار، ويمتلك القدرة على فهم واستيعاب أصعب الأشياء. مستقل برأيه لا يتقيد بالآراء والأفكار العامة، ويحب مناقشة والدفاع عن أفكاره. ", 'filds': ['قانون', 'علم نفس', 'تجارة و إدارة أعمال', 'هندسة', 'كلية علوم', 'تسويق', 'علاقات عامة', 'برمجة']},
            "ENTJ": {'disc': " رئيس الأركان وهي شخصية استراتيجية، منظمة، وتمتلكالمهارات الإدارية بشكل فطري. وهي أفضل من يعمل في مجال التنسيق وتوجيه المجموعات. رئيس الأركان لديه قدرة عالية على استيعاب الأنظمة وهيكلتها وبالتالي يتمكن من إيجاد حلول سريعة لأي مشكلة تواجه النظام القائم. ", 'filds': ['إدارة أعمال', 'تجارة', 'قانون']},
            "INTP": {'disc': " المعماري وهي شخصية عقلانية، مستقلة، متحفظة، وفضولية. يحب المعماري التركيز على الأفكار، النظريات وكيفية عمل الأشياء. وهو يتسم بالبراعة الفائقة في النقاش والجدال. ويمتاز المعماري بالقدرة على التركيز على عمل واحد، ويقدر ويحترم ذكاء الآخرين. ", 'filds': ['كلية علوم', 'إعلام', 'إدارة أعمال', 'محاسبة', 'رياضيات', 'هندسة', 'قانون', 'برمجة', 'هندسة حاسوب IT']},
            "INTJ": {'disc': " العقل المدبر وهي شخصية تحليلية وقادرة على قراءة الآخرين، مصممة وقائدة بالطبيعة. كونها متحفظة تفضل أن تبقى في الخلفية بعيداً عن الواجهة ومنها تقود الآخرين. ويمتلك العقل المدبر قدرة على التخطيط الإستراتيجي، وفي الغالب يكون مطلعاً بشكل كبير وقادر على التكيف مع الظروف التي يمر بها. وهي الشخصية التي تتميز بالقدرة على تحويل الأفكار من نظريات إلى الواقع يمكن تطبيقه. ", 'filds': ['هندسة حاسوب IT', 'هندسة', 'كلية تربية', 'طب', 'إدارة أعمال', 'سكرتارية', 'قانون', 'برمجة', 'هندسة حاسوب IT']},
            "ENFP": {'disc': " البطل وهي شخصية تتميز بالقدرة على الإستقراء، مدفوعة من القيم، ملهمة، إجتماعية وفصيحة للغاية. بشكل مستمر يقوم البطل بإطلاق أفكاره للعالم كطريقة لجذب الإنتباه لما يعتقد بأنه مهم، والذي في العادة ما يكون على علاقة بالأخلاق أو الأحداث الجارية. ", 'filds': ['علم نفس', 'إدارة أعمال', 'تجارة', 'كلية فنون', 'كلية تربية', 'علوم سياسية', 'صحافة و اعلام', 'برمجة', 'هندسة حاسوب IT']},
            "ENFJ": {'disc': " المدرس وهي شخصية محبوبة من الكل، حساسة، ومتقنة للمهارات الإجتماعية. جل إهتمامه بغيره، ويركز في ذلك على كيفية تفكير الناس وشعورهم. يبذل حياته لمساعدة الآخرين كي ينموا ويتطوروا. ويستخدم المدرس لذلك مهاراته الفائقة في التشجيع والدعم. ويحب أن يرى ثمرة إجتهاده وعمله مع الآخرين، في نموهم وتطورهم. ", 'filds': ['كلية تربية', 'علم نفس', 'كلية الشريعة', 'تسويق و مبيعات', 'سكرتارية']},
            "INFP": {'disc': " المعالج وهي شخصية تمتاز بالخصوصية، والقدرة على قراءة أفكار الآخرين. المعالج مبدع ومثالي لدرجة كبيرة، ودائماً ما يبحث عن مسار ذات معنى ليعيش من خلاله حياته. تحركه قيمه ويبحث دائماً عن السلام والراحة للجميع. ", 'filds': ['لغة عربية', 'إعلام', 'كلية تربية', 'علم نفس', 'كلية الشريعة']},
            "INFJ": {'disc': " المستشار وهي شخصية قوية ولكن هادئ ومتحفظ. حساس وفريد من نوعه، يتميز بإلتزامه بما يعمل عليه إلى حين إنجازه. شديد الإحساس وقراءة مشاعر من حوله، ويهتم كثيراً لمساندهم. في الغالب، يكون لديه نظام قيمي خاص به يؤمن ويلزم به لأقصى درجة.يميل لأن يكون مستقلاً على أن يكون قائداً أو تابعاً. المستشار شخصية تحقق الرضا الداخلي من مساعدة الآخرين ومعاونتهم. وهو مستمع ومحلل جيد. ولذلك أطلق عليه اسم المستشار، كونه يتعاطف مع من يواجه مشكلة، ويستمع إليه ولا يشعر بالرضا عن نفسه إلا حينما يتمكن من مساعدة صاحب المشكلة. ميوله الشخصية: انطوائي، حدسي، عاطفي، صارم. المستشار هو أحد المثاليين حسب نظرية كريسي للأمزجة. نسبة المستشارين، حسب دراسة على عينة هي الأقل بين جميع الشخصيات وتتراوح بين (1-3%). ", 'filds': ['كلية الشريعة', 'كلية التربية', 'طب', 'علوم صحية', 'علم نفس', 'إعلام', 'كلية تربية']},
            "ESFJ": {'disc': " المعطي وهي شخصية اجتماعية، تقدر العلاقات الإجتماعية، يحب دعم ورعاية الآخرين. لا تخجل أبداً من المشاركة في التجمعات والأنشطة الإجتماعية، بل في الغالب ما يكون المعطي هو المضيف لها. المعطي شخصية تحب العمل الجماعي، وتشجع جميع أعضاء الفريق على المشاركة والتفاعل في الفريق. لديه حسب بالمسؤولية، ويلتزم بالأوامر أو القوانين والأنظمة العامة. يهتم كثير بصدق بالناس من حوله. حساس تجاه النقد، ويحب أن يتم تقديره على الأمور الجيدة التي ينجزها. ميوله الشخصية: منفتح، حسي، عاطفي، وصارم. وهو أحد الأوصياء حسب نظرية كريسي للأمزجة. نسبة المعطين حسب دراسة أجريت على عينة  تتراوح بين 9-13% ", 'filds': ['إدارة أعمال', 'تمريض', 'كلية تربية', 'سكرتارية', 'محاسبة']},
            "ESTJ": {'disc': " المشرف وهي شخصية مسؤولة، منطقية، تحب إتباع الأنظمة، وعامل مجتهد. ودائماً ما يهدف إلى الخروج بألية عمل منظمة ومرتبة. المشرف يثق بالتجربة والحقائق، أكثر من النظريات العلمية. وهو شخص حاسم، مخلص، يحب التقيد بالتقاليد والعادات. يستمتع بتوليه للمسؤوليات، وحين يطلب منه ذلك فإنه يبرع في الإشراف على الآخرين. فهو يمتلك قدرة فائقة على التنظيم والتنسيق وترتيب الأعمال ومتابعة أدائها حتى النهاية. ميوله الشخصية: منفتح، حسي، عقلاني، وصارم. وهو أحد الأوصياء حسب نظرية كريسي للأمزجة. نسبة المشرفين حسب دراسة أجريت على عينة  تتراوح بين 8-12%. ", 'filds': ['إدارة اعمال', 'كلية الشرطة', 'قانون', 'محاسبة', 'كلية التربية', 'تسويق']},
            "ISFJ": {'disc': " المدافع وهي شخص هادئ وطيب القلب، ويقض الضمير ، دقيق الملاحظة والإحساس بما يشعر به الغير. يمكن الإعتماد عليه في متابعة العمل. عادة ما يقدم حاجات وطلبات الغير على حاجاته ورغباته الخاصة. مستقر وعملي، يقدر التقاليد السائدة والإستقرار. يهتم كثيراً بنظرة الناس له وشعورهم حوله. مهتم كثيراً بخدمة الناس وتلبية حاجاتهم وطلباتهم. ولا يسعى خلف السلطة.أطلق عليه اسم المدافع لكونه من أكثر الشخصيات إهتماماً بالناس والمحافظة على أمنهم وسلامتهم. ميوله الشخصية: إنطوائي، حسي، عاطفي، صارم. والمدافع هو أحد الأوصياء حسب نظرية كريسي للأمزجة. نسبة المدافعين، حسب دراسة على عينة  تتراوح بين (9-14%). ", 'filds': ['هندسة ديكور', 'إعلام', 'تمريض', 'إدارة أعمال', 'سكرتارية', 'كلية التربية', 'كلية الشريعة', 'محاسبة']},
            "ISTJ": {'disc': " المفتش وهي شخص مسؤول أهل لتحمل أعباء المسئوليات التي تلقى عليه، يعمل بجد وإخلاص. دقيق ولديه قدرة عاليه على التركيز في عمله. يقدر العادات والتقاليد في العمل أو في الحياة عامة، ويبذل جهده للمحافطة عليها. يفضل العيش بسلام مع من هم حوله. وشديد التضحية للمقربين منه. أطلق عليه اسم المفتش، لقدرته العالية على التمييز بين الصواب والخطأ، وكذلك حرصة الشديد على تأدية الوجبات المناطة به. ميوله الشخصية: إنطوائي، حسي، عقلاني، صارم. والمفتش هو إحدى الشخصيات التي تندرج تحت دور الأوصياء، حسب نظرية كريسي للأمزجة. نسبة المفتشين، حسب دراسة على عينة تتراوح بين (11-14%). ", 'filds': ['إدارة اعمال', 'محاسبة', 'كلية شرطة', 'قانون', 'طب', 'برمجة', 'هنسة حاسوب IT']},
            "ESFP": {'disc': " المؤدي وهي شخصية تحب الناس والمرح، يعيش ليومه ولا يفكر كثيراً في المستقبل. مغامر ويهوى تجربة الأشياء الجديدة. يجعل الأشياء أكثر متعة للآخرين من خلال إستمتاعه بما يعمل. يكره العزلة والوحدة، ويشعر بالنشاط والحماس عندما قيامه بشيء يلفت الإنتباه ويجعله مركز الإهتمام في التجمعات والأنشطة العامة. لديه حس كبير بالمنطق ومهارات العلاقات الإجتماعية. وأيضاً لديه جانب عملي يمكنه من تأدية الأعمال بكفاءة وفي الغالب ما يكون جيد في حل المشاكل اليومية. ميوله الشخصية: منفتح، حسي، عاطفي، ومتساهل. وهو أحد الفنانين حسب نظرية كريسي للأمزجة. نسبة المؤدين حسب دراسة أجريت على عينة  تتراوح بين 4-9%. ", 'filds': ['كلية الفنون', 'تسويق', 'كلية تربية', 'تصميم أزياء', 'هندسة ديكور', 'إعلام']},
            "ESTP": {'disc': " المروج وهي شخصية تحب الحركة، وتعيش يومها، واقعية وتمتاز بمهارات اجتماعية عالية. وهي لا تحب الرسميات، تحب المخاطرة، متسرعة وقابلة للتكيف مع الظروف. المروج لا يحب التقيد بالقوانين والأنظمة. أيضاً المروج يمتاز بالذكاء التكتيكي ويحب الحلول السريعة واللحظية. المروج شخصية متحمسة ولطيفة، صريح ومباشر في نقده، ولا يجد مشكلة في التعامل مع النقد الذي يوجه له. ميوله الشخصية: منفتح، حسي، عقلاني، ومتساهل. وهو أحد الفنانيين حسب نظرية كريسي للأمزجة. نسبة المروجين حسب دراسة أجريت على عينة  تتراوح بين 2-5%. ", 'filds': ['تسويق', 'إدارة أعمال', 'كلية الشرطة', 'علوم صحية', 'هندسة IT', 'هندسة معدات طبية']},
            "ISFP": {'disc': " الفنان وهي شخص هادئ، جاد، حساس وطيب القلب. لا يحب الإختلافات والصراعات، ولا يحب القيام بأعمال قد تسبب ذلك. مخلص ومؤمن بغيره. حواسه الخمس جداً متطورة، يقدر الجمال والفن ويحبه. لا يولي إهتماماً بقيادة الناس أو التحكم بهم. مرن ومتفتح العقل والخيال. يعيش ويستمتع بلحظته. أطلق عليه اسم الفنان لتطور حواسه الخمس وحدتها، مما يجعل منه في الغالب شخص مبدع ويرى جمالاً في الأشياء المحسوسة لا يراه غيره. ميوله الشخصية: إنطوائي، حسي، عاطفي، مرن. والفنان هو أحد الفنانيين حسب نظرية كريسي للأمزجة. نسبة الفنانين، أصحاب هذه الشخصية، حسب دراسة على عينة  تتراوح بين (5-9%). ", 'filds': ['كلية الفنون', 'إعلام', 'كلية تربية', 'علم نفس', 'طب', 'طب بيطري']},
            "ISTP": {'disc': " هادئ وهي ومتحفظ، يهتم بكيف ولماذا يعمل أو تعمل الأشياء. يعيش للحظة، وقد يقدم على إتخاذ خطوات جريئة في حياته كونه لا يفكر في المستقبل. غالباً ما يكون محباً أو ماهراً في الرياضات الخطرة. غير مقعد في ما يحب ويشتهي. مخلص جداً لأصدقائه والقيم التي يؤمن بها، وقد لا يحترم هذه القيم أو النظام العام، إن كانت في طريق إنجاز ما يرغب في تحقيقه. لا يحب الإرتباط ومحلل، قد يكون متميزاً جداً في حل المشاكل العملية. أطلق عليه الحرفي كونه في الغالب متقن للتعامل مع الأدوات والآلات. ميوله الشخصية: انطوائي، حسي، عقلاني، مرن. وهو إحدى الشخصيات التي تندرج تحت دور الفنانين حسب نظرية كريسي للأمزجة. نسبة الفنانين 4-6% ", 'filds': ['كلية الشرطة', 'طب', 'برمجة', 'هندسة', 'هندسة ميكاترونيكس', 'كلية الرياضة']},
        }
        questions = ["", "", "", "", "", "", "", "", "", "", "", ""]
        for i in range(12):
            questions[i] = tracker.get_slot(f"question_{i+1}")

        code = getcode(questions)
        dispatcher.utter_message(
            text=f" لقد حللت شخصيتك جيدا و استنتجت انك تمتلك شخصية{codes[code]['disc']} ")
        dispatcher.utter_message(
            text=f" و بناءا على المعطيات فاني اوصي بان تدرس احد التخصصات التالية")
        for fild in codes[code]['filds']:
            dispatcher.utter_message(text=f"{fild}")

        return []

#%%
